# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [ ]:
import pandas as pd

In [681]:
import cleaning_functions

In [127]:
data=pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')
display(data)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [128]:
#create copy of dataframe
data_copy=data.copy()
display(data_copy)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [135]:
#renaming column
data_copy=data_copy.rename(columns={"ST" : "STATE"})
data_copy

,Customer,STATE,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [136]:
#define function to make all column names in a dataframe lowercase
#would not work without"map"

def make_col_names_lowercase(dataframe: pd.DataFrame) -> pd.DataFrame:
    ''' 
    This function takes dataframe.columns and makes them lowercase
    Inputs:
    dataframe: pd.DataFrame
    Output: pd.DataFrame
    '''
    
    df_copy=dataframe.copy()
    
    df_copy.columns = df_copy.columns.map(str.lower)

    return df_copy

In [ ]:
        #df_copy.columns = df_copy.columns.map(lambda x: x.upper())    
    #df2['gender'] = df2['gender'].apply(lambda x: x[0].upper() if x[0].upper() in ['M', 'F'] else "U")
        #df2['gender'] = list(map(lambda x: x[0].upper() if x[0].upper() in ['M', 'F'] else "U", df2['gender']))

In [137]:
#call function
data_copy = make_col_names_lowercase(data_copy)
data_copy.head(2)

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [108]:
#define function to replace  "_" for " " in all column names in a dataframe lowercase
#would not work with map or with lambda

def remove_blanks_in_col_names(dataframe: pd.DataFrame) -> pd.DataFrame:
    ''' 
    This function removes blank characters in dataframe column names
    Inputs:
    dataframe: pd.DataFrame
    '''
    df_no_blanks=dataframe.copy()
    
    df_no_blanks.columns = df_no_blanks.columns.str.replace(' ','_')
    return df_no_blanks

In [138]:
#call function
data_copy = remove_blanks_in_col_names(data_copy)
data_copy.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [143]:
data=data_copy.copy()

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [230]:
#to analyze the data
data_e2.nunique()

customer                     1071
state                           8
gender                          5
education                       6
customer_lifetime_value      1027
income                        774
monthly_premium_auto          132
number_of_open_complaints       6
policy_type                     3
vehicle_class                   6
total_claim_amount            761
dtype: int64

In [ ]:
#to analyze the data

for col in data_e2.columns:
    unique_values=data_e2[col].unique()
    print("Unique values in column {} : {}".format(col,unique_values))

#part 1: work on fixing issues in columns: gender ok, state ok, education, customer lifetime value, vehicle class

In [485]:
import numpy as np

In [483]:
#define function to fix gender types. Includes a check for strings as some values may have been floats, producing errors.
def fix_gender_types(df: pd.DataFrame) -> pd.DataFrame:
    '''
    this function replaces each record of ender with the first letter of each string.
    Inputs:
    pd: DataFrame
    Outputs: pd.DataFrame
    '''
    df_f=df.copy()
    if 'gender' in df_f.columns:
        df_f['gender'] = list(map(lambda x: x[0].upper() if isinstance(x, str) and x[0].upper() in ['M', 'F'] else np.nan, df_f['gender']))
        return df_f
    else:
        return df_f

In [484]:
#call function
data_e3=fix_gender_types(data)

In [664]:
data_e3['gender'].unique()

array([nan, 'F', 'M'], dtype=object)

In [233]:
#define function to fix state values, education, vehicle class. 
#this function is not modular is it does multiple things at once. it was created to practice embedding dictionaries within dictionaries

def fix_state_names_and_education_and_vehicle_class(df: pd.DataFrame) -> pd.DataFrame:
    '''
    this function replaces each abbreviation with the full state name as in the dictionary defined in the function.
    Inputs:
    pd: DataFrame
    Outputs: pd.DataFrame
    '''
    df_f=df.copy()
    replacement_dictionary = {'state': {'Cali': 'California', 'AZ': 'Arizona', 'WA': 'Washington'},
                             'education': {'Bachelors': 'Bachelor'},
                             'vehicle_class': {'Luxury SUV': 'Luxury', 'Sports Car': 'Luxury', 'Luxury Car': 'Luxury'}}
    if 'state' or 'education' in df_f.columns:
        df_f = df_f.replace(replacement_dictionary)
        return df_f
    else:
        return df_f

In [234]:
#call function
data_e3=fix_state_names_and_education_and_vehicle_class(data_e3)

In [214]:
#column checks
data_e5['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [235]:
#define function to replace one value for no value in a specific column
#can be used to replace % in the customer lifetime value column

def remove_char_in_rows(df: pd.DataFrame, column_name: str, char: str) -> pd.DataFrame:
    '''
    This function replace one value for no value in a specific column 
    can be used to replace % in the customer lifetime value column
    Inputs:
    dataframe: pd.DataFrame
    '''
    df_f=df.copy()
    
    df_f[column_name] = df[column_name].str.replace(char,'')
    return df_f

In [236]:
#call function
data_e3=remove_char_in_rows(data_e3,'customer_lifetime_value','%')

In [148]:
#column checks
data_e2.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [360]:
data_2=data.copy()

In [361]:
# see data types
print(data_2.dtypes)

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [362]:
#convert column to numeric
data_2['customer_lifetime_value'] =  pd.to_numeric(data_2['customer_lifetime_value'], errors='coerce')

In [373]:
data_3=data_2.copy()

In [372]:
data_3['number_of_open_complaints'].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [268]:
#data_4=data_2.copy()

In [278]:
# dropna
#data_4=data_4.dropna()

In [376]:
# split number_of_open_complaints' into multiple columns separating by '/'
data_3[['a','b','c']]=data_3['number_of_open_complaints'].str.split('/', n=2, expand=True)

In [379]:
# replace 'number_of_open_complaints' with the 2nd element of itself
data_3['number_of_open_complaints']=data_3['b']

In [381]:
# drop additional columns created by str.split
data_3=data_3.drop(columns=['a', 'b', 'c'])

In [438]:
#alternative to previous method, by splitting, selecting the element containing open complaints and replace original column
#df['full_gender'] = df['full_gender'].str.split().str[0] #check, correct element might be [1]
data_oc_test=pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')
data_oc_test_2=data_oc_test.copy()
data_oc_test_2['Number of Open Complaints'] = data_oc_test_2['Number of Open Complaints'].str.split('/', n=2, expand=False).str[0]

In [385]:
#convert to numeric column
data_3['number_of_open_complaints'] =  pd.to_numeric(data_3['number_of_open_complaints'], errors='coerce')

In [392]:
data_3=pd.DataFrame(data_3)

In [442]:
type(data_3)

pandas.core.frame.DataFrame

In [686]:
#data checks
data.dtypes

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using `applymap()`.

In [509]:
# data exploration: not null
data.notnull().sum()/len(data)*100
#gender OK. 2nd tier; rest = cust lifetime value slightly lower.

customer                     26.721557
state                        26.721557
gender                       23.802395
education                    26.721557
customer_lifetime_value      26.646707
income                       26.721557
monthly_premium_auto         26.721557
number_of_open_complaints    26.721557
policy_type                  26.721557
vehicle_class                26.721557
total_claim_amount           26.721557
dtype: float64

In [488]:
# data exploration: # of null rows per column
data.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [489]:
## data exploration: find rows where all values are null.
data_null_rows=data.copy()

In [490]:
# create df of all-null rows for exploration
data_null_rows_1 = data_null_rows[data_null_rows.isnull().all(axis=1)]

In [491]:
# display dataframe
data_null_rows_1

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1071,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1072,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1073,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1074,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1075,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [492]:
#data exploration = null values in customer lifetime value
data_null_rows_filtered = data_null_rows[data_null_rows['customer_lifetime_value'].isnull() & data_null_rows['customer'].notnull()]

In [493]:
data_null_rows_filtered

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
78,SP81997,Washington,F,Master,NaN,41275.0,96.0,0.0,Personal Auto,Four-Door Car,41.122303
988,GT62080,Washington,M,High School or Below,NaN,55561.0,63.0,0.0,Personal Auto,Four-Door Car,227.872071

In [ ]:
#after the data exploration, it is suggested to remove all columns that are all-nulls.
#regarding the three instances of nulls in customer lifetime value, it is suggested to remove those columns as well.
#however, for the sake of practicing pandas functionalities, a median will be estimates and assigned to these values
#gender

In [494]:
data.isna().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [506]:
#test; drop na threshold.
data_drop_na_thresh_2 = data.dropna(thresh=2)
data_drop_na_thresh_2.isna().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [521]:
# drop all rows where customer or customer lifetime value is NA
data_drop_na_customer = data.dropna(subset = ['customer','customer_lifetime_value'])

In [650]:
# create function to drop na rows

def drop_na_rows(df: pd.DataFrame, *column_names) -> pd.DataFrame:
    '''
    function to drop na rows
    Input:
    DataFrame
    Column names: tuple
    Output:
    DataFrame
    '''
    df_c=df.copy()
    if all(col in df_c.columns for col in column_names):
    #if column_names in df_c.columns:
        df_c=df_c.dropna(subset = column_names)
    else:
        pass
    return df_c

In [651]:
data_test_1=pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')
display(data_test_1.columns)

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [652]:
data_test_1.shape

(4008, 11)

In [663]:
data_test_2=drop_na_rows(data_test_1, 'Customer','Customer Lifetime Value')
data_test_2

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,Bachelor,825629.78%,62902.0,69.0,1/0/00,Personal Auto,Two-Door Car,159.383042
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,M,Master,305955.03%,38644.0,78.0,1/1/00,Personal Auto,Four-Door Car,361.455219
1067,VJ51327,Cali,F,High School or Below,2031499.76%,63209.0,102.0,1/2/00,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.47%,16061.0,88.0,1/0/00,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.11%,79487.0,114.0,1/0/00,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.02%,54230.0,112.0,1/0/00,Personal Auto,Two-Door Car,537.600000

In [522]:
data_drop_na_customer.isna().sum()

customer                       0
state                          0
gender                       116
education                      0
customer_lifetime_value        0
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [520]:
data_drop_na_customer.isnull().sum()/len(data_drop_na_customer)*100

customer                      0.000000
state                         0.000000
gender                       10.861423
education                     0.000000
customer_lifetime_value       0.000000
income                        0.000000
monthly_premium_auto          0.000000
number_of_open_complaints     0.000000
policy_type                   0.000000
vehicle_class                 0.000000
total_claim_amount            0.000000
dtype: float64

In [524]:
data=data_drop_na_customer.copy()

In [553]:
data.isna().sum()

customer                       0
state                          0
gender                       116
education                      0
customer_lifetime_value        0
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [554]:
#replace gender
data_2=data.fillna(method = 'ffill')

In [556]:
data_2.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints    float64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [579]:
#create function to convert floats to ints
#used apply as applymap is being deprecated
def convert_numeric_col_to_integers (df: pd.DataFrame) -> pd.DataFrame:
    '''
    convert float64 to integers
    Inputs:
    DataFrame
    Output:
    DataFrame
    '''
    
    for column_name in df.columns:
        if df[column_name].dtype in ['float64']:
            df[column_name] = df[column_name].apply(lambda x: int() if x.dtype in ['float64'] else x)
        else:
            pass
    return df

In [580]:
#call function
data_converted = convert_numeric_col_to_integers(data)
data_converted

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1,QZ44356,Arizona,F,Bachelor,697953,0,94,0,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17
5,OC83172,Oregon,F,Bachelor,825629,62902,69,0,Personal Auto,Two-Door Car,159
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,M,Master,305955,38644,78,1,Personal Auto,Four-Door Car,361
1067,VJ51327,California,F,High School or Below,2031499,63209,102,2,Personal Auto,SUV,207
1068,GS98873,Arizona,F,Bachelor,323912,16061,88,0,Personal Auto,Four-Door Car,633
1069,CW49887,California,F,Master,462680,79487,114,0,Special Auto,SUV,547
1070,MY31220,California,F,College,899704,54230,112,0,Personal Auto,Two-Door Car,537

In [581]:
#confirm changesin dtypes
data_converted.dtypes

customer                     object
state                        object
gender                       object
education                    object
customer_lifetime_value       int64
income                        int64
monthly_premium_auto          int64
number_of_open_complaints     int64
policy_type                  object
vehicle_class                object
total_claim_amount            int64
dtype: object

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [540]:
#check duplicates
data_2=data['customer'].duplicated().sum()
data_2

0

In [545]:
#removing duplicates
data_no_duplicates = data.drop_duplicates(subset=['customer'])

In [546]:
#check duplicates
data_no_duplicates['customer'].duplicated().sum()

0

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [666]:
! touch cleaning_functions.py

In [682]:
! cat cleaning_functions.py

import pandas as pd

#define function to make all column names in a dataframe lowercase
#would not work without"map"

def make_col_names_lowercase(dataframe: pd.DataFrame) -> pd.DataFrame:
    '''
    This function takes dataframe.columns and makes them lowercase
    Inputs:
    dataframe: pd.DataFrame
    Output: pd.DataFrame
    '''

    df_copy=dataframe.copy()

    df_copy.columns = df_copy.columns.map(str.lower)

    return df_copy

#define function to replace  "_" for " " in all column names in a dataframe lowercase
#would not work with map or with lambda

def remove_blanks_in_col_names(dataframe: pd.DataFrame) -> pd.DataFrame:
    '''
    This function removes blank characters in dataframe column names
    Inputs:
    dataframe: pd.DataFrame
    '''
    df_no_blanks=dataframe.copy()

    df_no_blanks.columns = df_no_blanks.columns.str.replace(' ','_')
    return df_no_blanks


#define function to fix gender types. Includes a check for strings as some values may have been floats, producing errors.
def fix_gender_types(df: pd.DataFrame) -> pd.DataFrame:
    '''
    this function replaces each record of ender with the first letter of each string.
    Inputs:
    pd: DataFrame
    Outputs: pd.DataFrame
    '''
    df_f=df.copy()
    if 'gender' in df_f.columns:
        df_f['gender'] = list(map(lambda x: x[0].upper() if isinstance(x, str) and x[0].upper() in ['M', 'F'] else np.nan, df_f['gender']))
        return df_f
    else:
        return df_f


#define function to fix state values, education, vehicle class.
#this function is not modular is it does multiple things at once. it was created to practice embedding dictionaries within dictionaries

def fix_state_names_and_education_and_vehicle_class(df: pd.DataFrame) -> pd.DataFrame:
    '''
    this function replaces each abbreviation with the full state name as in the dictionary defined in the function.
    Inputs:
    pd: DataFrame
    Outputs: pd.DataFrame
    '''
    df_f=df.copy()
    replacement_dictionary = {'state': {'Cali': 'California', 'AZ': 'Arizona', 'WA': 'Washington'},
                             'education': {'Bachelors': 'Bachelor'},
                             'vehicle_class': {'Luxury SUV': 'Luxury', 'Sports Car': 'Luxury', 'Luxury Car': 'Luxury'}}
    if 'state' or 'education' in df_f.columns:
        df_f = df_f.replace(replacement_dictionary)
        return df_f
    else:
        return df_f


#define function to replace one value for no value in a specific column
#can be used to replace % in the customer lifetime value column

def remove_char_in_rows(df: pd.DataFrame, column_name: str, char: str) -> pd.DataFrame:
    '''
    This function replace one value for no value in a specific column
    can be used to replace % in the customer lifetime value column
    Inputs:
    dataframe: pd.DataFrame
    '''
    df_f=df.copy()

    df_f[column_name] = df[column_name].str.replace(char,'')
    return df_f

# create function to drop na rows

def drop_na_rows(df: pd.DataFrame, *column_names) -> pd.DataFrame:
    '''
    function to drop na rows
    Input:
    DataFrame
    Column names: tuple
    Output:
    DataFrame
    '''
    df_c=df.copy()
    if all(col in df_c.columns for col in column_names):
    #if column_names in df_c.columns:
        df_c=df_c.dropna(subset = column_names)
    else:
        pass
    return df_c



#create function to convert floats to ints
#used apply as applymap is being deprecated
def convert_numeric_col_to_integers (df: pd.DataFrame) -> pd.DataFrame:
    '''
    convert float64 to integers
    Inputs:
    DataFrame
    Output:
    DataFrame
    '''

    for column_name in df.columns:
        if df[column_name].dtype in ['float64']:
            df[column_name] = df[column_name].apply(lambda x: int() if x.dtype in ['float64'] else x)
        else:
            pass
    return df


#parent functions to clean up a dataframe

def cleaning_functions_dataframe(df: pd.DataFrame, *column_names) -> pd.DataFrame:
    '''
    This function will take a Pandas DataFrame and it will apply the previous functions in the library
    to clean some columns of the dataframe

    Inputs:
    df: Pandas DataFrame

    Outputs:
    Another DataFrame
    '''

    df2 = df.copy()

    df2 = make_col_names_lowercase(df2)
    df2 = remove_blanks_in_col_names(df2)
    df2 = fix_gender_types(df2)
    df2 = fix_state_names_and_education_and_vehicle_class(df2)
    df2 = convert_numeric_col_to_integers(df2)
    df2 = drop_na_rows(df2, *column_names)

    return df2

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [689]:
#explora total claim amount and cust lifetime value before any filtering
round(data[['total_claim_amount','customer_lifetime_value']].describe(),0)

       total_claim_amount  customer_lifetime_value
count              1068.0                   1068.0
mean                405.0                 793690.0
std                 293.0                 643478.0
min                   0.0                 200435.0
25%                 204.0                 403408.0
50%                 355.0                 588174.0
75%                 532.0                 896287.0
max                2893.0                5816655.0

In [700]:
#extract required quantiles for both variables
claim_amount_p_75 = data['total_claim_amount'].quantile(0.75)
cust_lvalue_p_25 = data['customer_lifetime_value'].quantile(0.25)
print('claim_amount percentile_75 is {}'.format(claim_amount_p_75))
print('customer_lifetime value_percentile_25 is {}'.format(cust_lvalue_p_25))

claim_amount percentile_75 is 532.0
customer_lifetime value_percentile_25 is 403407.75

In [703]:
#create new filtered dataframe contaning the high claims but low value customers
high_claims_low_value = data[(data['total_claim_amount'] > claim_amount_p_75) & (data['customer_lifetime_value'] < cust_lvalue_p_25)]
high_claims_low_value.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
17,OE15005,California,NaN,College,394524,28855,101,0,Personal Auto,SUV,647
23,TZ98966,Nevada,NaN,Bachelor,245019,0,73,3,Corporate Auto,Four-Door Car,554
26,US89481,California,NaN,Bachelor,394637,0,111,0,Personal Auto,Four-Door Car,799
38,CM61827,Oregon,NaN,Bachelor,309003,0,90,0,Personal Auto,Two-Door Car,648
42,IL19217,California,NaN,Bachelor,393900,60021,99,0,Personal Auto,Four-Door Car,882

In [712]:
#descriptive statistics for both variables
high_claims_low_value[['total_claim_amount','customer_lifetime_value']].median()

total_claim_amount            685.0
customer_lifetime_value    365995.0
dtype: float64

In [710]:
#descriptive statistics for both variables
high_claims_low_value[['total_claim_amount','customer_lifetime_value']].mode()

   total_claim_amount  customer_lifetime_value
0                 701                 387364.0
1                 799                      NaN

In [704]:
#descriptive statistics for both variables
round(high_claims_low_value[['total_claim_amount','customer_lifetime_value']].describe(),0)

       total_claim_amount  customer_lifetime_value
count                40.0                     40.0
mean                723.0                 341577.0
std                 149.0                  56921.0
min                 537.0                 228759.0
25%                 633.0                 304220.0
50%                 685.0                 365995.0
75%                 799.0                 387364.0
max                1185.0                 402381.0

There are only 40 customers than fit in in both categories (top 25% claim amounts and lower 25% customer lifetime value)
The minimum claim amount in this sample is 537 whereas the maximum is 1185. Distribution-wise the data is rightly skewed as the mean is lower than the median.
Regarding customer lifetime value the minimum value is 228759 while the maximum is 402381. The data is rightly skewed as the mean is lower than the median.

In [608]:
#test
data[(data['policy_type'] == 'Corporate Auto') & (data['education'] == 'Bachelor')].groupby(['state','gender'])[['customer_lifetime_value']].mean()
data[(data['policy_type'] == 'Corporate Auto') & (data['education'] == 'Bachelor')].groupby(['state','gender']).agg(['customer_lifetime_value': mean, 'income': sum])

#df[ df[‘year’] == 2016 ].groupby(‘deparment’)[‘salary’].mean() -> pd.Series
#df[ df[‘year’] == 2016 ].groupby(‘deparment’)[[‘salary’]].mean() -> pd.DataFrame
#	df.groupby(‘product_category’).agg({‘price’: sum, ‘sales’: mean}) --> mul. columns

                   customer_lifetime_value
state      gender
Arizona    F                 911671.428571
           M                 467164.833333
California F                 768507.000000
           M                 823297.538462
Nevada     F                 477225.000000
           M                 465621.666667
Oregon     F                 800268.875000
           M                 819938.733333
Washington F                 552421.000000

In [714]:
! ls

README.md
__pycache__
cleaning_functions.py
lab-dw-data-cleaning-and-formatting.ipynb

In [ ]:
/Users/alexferrer/Desktop/bootcamp/Week_1/Day_3/Afternoon/lab-dw-data-cleaning-and-formatting